# NavisworksExportOptions Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
NavisworksExportOptions Constructor
NavisworksExportOptions Class See Also
---
Create an instance of Navisworks Export Options set with default values.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public NavisworksExportOptions()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
NavisworksExportOptions()
```

# See Also
NavisworksExportOptions Class
Autodesk.Revit.DB Namespace